Revit 2027 API
CurtainGridSet.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	CurtainGrid item
)
Public Overridable Function Insert (
	item As CurtainGrid
) As Boolean
public:
virtual bool Insert(
	CurtainGrid^ item
)
abstract Insert :
        item : CurtainGrid -> bool
override Insert :
        item : CurtainGrid -> bool
Parameters
item CurtainGrid
Return Value
Boolean
See Also
Reference
CurtainGridSet Class
Autodesk.Revit.DB Namespace